In [1]:
import numpy as np
import pandas as pd

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

#### Data

In [32]:
df = pd.read_csv("student.csv")

In [3]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

#### Sütun Ekleme

In [4]:
df["full_name"] = df["name"] + " " + df["lastName"]

In [5]:
df

        name lastName  age  number          full_name
0    Alperen  Kolamuc   18     401    Alperen Kolamuc
1  Cristiano  Ronaldo   35     303  Cristiano Ronaldo
2      Sinan    Engin   48     105        Sinan Engin
3      Fırat  Aydınus   42     216      Fırat Aydınus

#### Sütun Silmek

In [6]:
df

        name lastName  age  number          full_name
0    Alperen  Kolamuc   18     401    Alperen Kolamuc
1  Cristiano  Ronaldo   35     303  Cristiano Ronaldo
2      Sinan    Engin   48     105        Sinan Engin
3      Fırat  Aydınus   42     216      Fırat Aydınus

In [7]:
b = df.drop(columns=["name", "lastName"])

In [8]:
b

   age  number          full_name
0   18     401    Alperen Kolamuc
1   35     303  Cristiano Ronaldo
2   48     105        Sinan Engin
3   42     216      Fırat Aydınus

In [10]:
df

   age  number          full_name
0   18     401    Alperen Kolamuc
1   35     303  Cristiano Ronaldo
2   48     105        Sinan Engin
3   42     216      Fırat Aydınus

#### Satır Ekleme

In [13]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [14]:
df.append({"name":"Ahmet", "age": 50}, ignore_index=True)

        name lastName  age  number
0    Alperen  Kolamuc   18   401.0
1  Cristiano  Ronaldo   35   303.0
2      Sinan    Engin   48   105.0
3      Fırat  Aydınus   42   216.0
4      Ahmet      NaN   50     NaN

#### İki DataFrame'i Birleştirmek

In [18]:
df2 = pd.read_csv("data2.csv")

In [19]:
df2

      name   lastName  age
0     Neal   Amstrong   48
1     Yuri    Gagarin   45
2  Mustafa  Topaloglu   18
3    Isaac     Coffay   31

In [20]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [30]:
df2 = pd.read_csv("data2.csv")

In [31]:
df2

      name   lastName  age
0     Neal   Amstrong   48
1     Yuri    Gagarin   45
2  Mustafa  Topaloglu   18
3    Isaac     Coffay   31

In [33]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [36]:
df3 = df.append(df2, sort=False)

In [37]:
df3

        name   lastName  age  number
0    Alperen    Kolamuc   18   401.0
1  Cristiano    Ronaldo   35   303.0
2      Sinan      Engin   48   105.0
3      Fırat    Aydınus   42   216.0
0       Neal   Amstrong   48     NaN
1       Yuri    Gagarin   45     NaN
2    Mustafa  Topaloglu   18     NaN
3      Isaac     Coffay   31     NaN

#### Satırları Silmek

In [38]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [39]:
df.drop(index=2)

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
3      Fırat  Aydınus   42     216

In [40]:
filt = (df["age"] > 35)

In [41]:
filt

0    False
1    False
2     True
3     True
Name: age, dtype: bool

In [42]:
df[filt]

    name lastName  age  number
2  Sinan    Engin   48     105
3  Fırat  Aydınus   42     216

In [43]:
df[filt].index

Int64Index([2, 3], dtype='int64')

In [44]:
df.drop(index=df[filt].index)

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303